#include <stdio.h>
#include <locale.h>
int main()

{
//№1
	setlocale(LC_ALL,"RUS");

	printf("№1\n");

	printf("%20s\n", "Это текст");
	printf("%10.5f\n ", 12.234657);
	printf("Остаток от деления %d на %d равно %d\n ", 7, 5,7 % 5);
	printf("Умножение %d на %d равен %d\n ", 2000, 4, 2000 * 4);
	printf("%g разделить %e равно %f\n ", 5., 2., 5. / 2);

//№2
	printf("№2\n");


	int N = 19, K = 23;
	printf("Сейчас %d часов и %d минуты\n ", N, K);
	printf("Идет %d минута суток\n ", N * 60 + K);
	printf("До полуночи осталось %d часов и %d минут\n ", 23 - N, 60 - K);
	printf("С 8.00 прошло %d секунд\n ", (N-8)*3600+K*60);
	printf("Текущий час=%f суток и текущая минута=%f часа\n ", N/24., K/60.);

//№3
//Вариант 4
	printf("№3\n");

	int n = 2;
	printf("Данные:\n \t 2 \n\t 333 \n\t ______\n Ответ: %6.3f", n/333.);
}